'''
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
Дано a, b, c — стороны предполагаемого треугольника.
Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует.
Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.
'''
a = int(input(f'Введите длину сторону a: '))
b = int(input(f'Введите длину сторону b: '))
c = int(input(f'Введите длину сторону c: '))
message = 'Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.'

if (a + b) > c and (b + c) > a and (c + a) > b:
    if a == b and b == c:
        message = "Треугольник равносторонний."
    elif a == b or b == c or c == a:
        message = "Треугольник равнобедренный."
    else:
        message = "Треугольник разносторонний."

print(message)
