'''
Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
Используйте правило для проверки: «Число является простым, если делится нацело только на единицу и на себя».
Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
'''
limit = 10
number = -1
while number < 0 or number >= limit:
    number = int(input(f'Введите положительное число и меньше {limit}: '))

text = 'Число простое.'

for i in range(2, number):
    if number % i == 0:
        text = 'Число составное.'
        break

print(text)

