#  В большой текстовой строке подсчитать количество встречаемых
# слов и вернуть 10 самых частых. Не учитывать знаки препинания
# и регистр символов. За основу возьмите любую статью
# из википедии или из документации к языку.

text = open(file='War&Peace.txt', mode='r', encoding='utf-8')
# Читаем большой текст, приводим всё к нижнему регистру и разделяем по пробелу
text = text.read().lower().split()
# Отбрасываем все не буквенные символы
text = [''.join(list(filter(str.isalpha, i))) for i in text]

# Создаём множество уникальных слов
set_text = set(text)
set_text.discard('')

# Создаём словарь, где ключ - слово из текста, а значение - количество вхождений слов в текст
dict_text = dict()
for i in set_text:
    dict_text[i] = text.count(i)

# Переводим словарь >>> кортеж, кортеж >>> список, далее сортируем список
text2 = list(dict_text.items())
text2.sort(key=lambda i: i[1], reverse=True)

# Возвращаем 10 наиболее популярных слов
print(text2[:9:])
