#  В большой текстовой строке подсчитать количество встречаемых
# слов и вернуть 10 самых частых. Не учитывать знаки препинания
# и регистр символов. За основу возьмите любую статью
# из википедии или из документации к языку.

text = open(file='War&Peace.txt', mode='r', encoding='utf-8')
# Читаем большой текст, приводим всё к нижнему регистру и разделяем по пробелу
text = text.read(1000).lower().split()
# Отбрасываем все не буквенные символы
text = [''.join(list(filter(str.isalpha, i))) for i in text]

new_text = sorted([(text.count(i), i) for i in set(text) if i != ''], reverse=True)

# Возвращаем 10 наиболее популярных слов
print(new_text[:10:])
