# ✔ Выведите в консоль таблицу умножения
# от 2х2 до 9х10 как на школьной тетрадке.
# ✔ Таблицу создайте в виде однострочного
# генератора, где каждый элемент генератора —
# отдельный пример таблицы умножения.
# ✔ Для вывода результата используйте «принт»
# без перехода на новую строку.


print(*(f'{j} x {i:>2} = {j * i:>2}\n'
        if j == 5 else
        f'{j} x {i:>2} = {j * i:>2}\t\t'
        for i in range(2, 11)
        for j in range(2, 6)))

print(*(f'{j} x {i:>2} = {j * i:>2}\n'
        if j == 9 else
        f'{j} x {i:>2} = {j * i:>2}\t\t'
        for i in range(2, 11)
        for j in range(6, 10)))

