'''
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.
'''

num = 1
bl = False
fl = 2.5
st = "str"

print(type(num))
print(type(bl))
print(type(fl))
print(type(st))


