'''
Создайте в переменной data список значений разных типов перечислив их через
запятую внутри квадратных скобок. Для каждого элемента в цикле выведите:
✔ порядковый номер начиная с единицы
✔ значение
✔ адрес в памяти
✔ размер в памяти
✔ хэш объекта
✔ результат проверки на целое число только если он положительный
✔ результат проверки на строку только если он положительный
Добавьте в список повторяющиеся элементы и сравните на результаты
'''


data = [1, 1, 3, 2.5, 'Hi', 'Buy', True]

for i in range(len(data)):
    print(f"№ {i+1}")
    print(f"Значение\t{data[i]}")
    print(f"id\t{id(data[i])}")
    print(f"Размер\t{data[i].__sizeof__()}")
    print(f"Hash\t{hash(data[i])}")
    print(f"Число?\t{isinstance(data[i], int)}")
    print(f"Строка?\t{isinstance(data[i], str)}")
    print("~" * 25)


