'''
✔ Напишите программу, которая получает целое число и возвращает
его двоичное, восьмеричное строковое представление.
✔ Функции bin и oct используйте для проверки своего
результата, а не для решения.

Дополнительно:
✔ Попробуйте избежать дублирования кода
в преобразованиях к разным системам счисления
✔ Избегайте магических чисел
✔ Добавьте аннотацию типов где это возможно
'''

num = int(input('Введите число: '))
sys = int(input('Введите систему: '))
res = ''
ls_num = '0123456789abcdef'

if sys == 2:
    print(bin(num)[2:])
elif sys == 8:
    print(oct(num)[2:])
elif sys == 16:
    print(hex(num)[2:])

while num > 0:
    res = f"{ls_num[num % sys]}{res}"
    num //= sys

print(res)

