import math
from decimal import getcontext, Decimal

'''
✔ Напишите программу, которая вычисляет площадь
круга и длину окружности по введённому диаметру.
✔ Диаметр не превышает 1000 у.е.
✔ Точность вычислений должна составлять
не менее 42 знаков после запятой.
'''


getcontext().prec = 43

d = float(input('Введите диаметр: '))

print('Площадь круга: ', Decimal(math.pi * (d/2**2)))
print('Длина круга: ', Decimal(math.pi*d))

