text = """
Напишите функцию, которая принимает строку текста.
Вывести функцией каждое слово с новой строки.
✔ Строки нумеруются начиная с единицы.
✔ Слова выводятся отсортированными согласно кодировки Unicode.
✔ Текст выравнивается по правому краю так, чтобы у самого
длинного слова был один пробел между ним и номером строки.
"""


def func(s: str) -> str:
    new_s = sorted(s.split())
    max_len = len(max(new_s, key=lambda i: len(i)))
    res = ''
    for i in range(1, len(new_s)):
        res += f'{i} {new_s[i - 1]: >{max_len}} \n'
    return res


print(func(text))
